TD_arbre.org
* Exo n°1 

** Question n°1

*** Implémentation 

    Un arbre sera donc composé : 
    - un tableau (tab)
    - La taille du tableau.
    - L'index/Valeur de la racine (sinon on pourrait le retrouver en parcourant le tableau à la recherche de la case contenant la valeur -1 (Soit une comp. temp. O(n) au pire cas, n étant la taille du tableau)).
    - Les noeuds seront donc représentés par leur index. 

*** CreerArbre O(1)

#+BEGIN_SRC C
  Arbre CreerArbre(int taille)
  {
    Arbre a = new Arbre();
    a.tab = int[taille];
    a.taille = taille;
    a.racine = -1; //On ne sait pas encore l'index de la racine lors de l'initialisation de l'arbre
    return a;
  }
#+END_SRC

*** Racine O(1) vu qu'on stock son index

#+BEGIN_SRC C
     int Racine(Arbre a)
   {
     return a.racine;
   }
#+END_SRC

*** FilsNoeud O(n)

#+BEGIN_SRC C
  Liste FilsNoeud(Arbre a,int indexNoeud)
  {
    Liste l = CreerListe();
    for (int i = 0; i < a.taille; i ++)
      {
        if(a.tab[i] == indexNoeud)
          {
            l.insererTeteListe(i);
          }
      }
    return l;
  }
#+END_SRC

*** SontFreres O(1)
#+BEGIN_SRC C
  bool SontFreres(Arbre a, int noeud_x, int noeud_y)
  {
    return a.tab[noued_x] == a.tab[noued_y]; 
  }
#+END_SRC

