TD_arbre.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 dim. 16:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="cliquot" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org36480e9">1. Exo n°1</a>
<ul>
<li><a href="#org089866b">1.1. Question n°1</a>
<ul>
<li><a href="#org5e161d5">1.1.1. Implémentation</a></li>
<li><a href="#org8cc43ad">1.1.2. CreerArbre O(1)</a></li>
<li><a href="#org77a3929">1.1.3. Racine O(1) vu qu'on stock son index</a></li>
<li><a href="#org3d7feb8">1.1.4. FilsNoeud O(n)</a></li>
<li><a href="#org0090fb2">1.1.5. SontFreres O(1)</a></li>
<li><a href="#orgc189219">1.1.6. Hauteur O(\(n^2\))</a></li>
<li><a href="#orgd3f30e0">1.1.7. SousArbre \(O(n^2)\)</a></li>
</ul>
</li>
<li><a href="#orgdb5d605">1.2. Question n°2</a></li>
</ul>
</li>
<li><a href="#org4f428b7">2. Exo n°2</a>
<ul>
<li><a href="#orgbfbd61a">2.1. Question n°1</a></li>
<li><a href="#org8b883bb">2.2. Question n°2</a></li>
<li><a href="#orgc0131cf">2.3. Question n°3</a></li>
<li><a href="#orgf5859dc">2.4. Question n°4</a></li>
<li><a href="#org8855da8">2.5. Question n°5</a>
<ul>
<li><a href="#org1c8e909">2.5.1. construire-tas O(1)</a></li>
<li><a href="#org761759c">2.5.2. inserer O(log(n))</a></li>
<li><a href="#orgb9ef2d3">2.5.3. entasser-min O(h) = O(log(n))</a></li>
<li><a href="#orga3768a2">2.5.4. minimum O(1)</a></li>
<li><a href="#org1c71a71">2.5.5. remplacerCle O(h(x)) ou O(h-h(x))</a></li>
<li><a href="#org547da7c">2.5.6. retirerElement O(h)</a></li>
</ul>
</li>
<li><a href="#org2f822b1">2.6. Question n°6</a></li>
<li><a href="#orgd3bd641">2.7. Question n°7 O(n*log(n))</a></li>
<li><a href="#org860d81d">2.8. Question n°8</a></li>
</ul>
</li>
<li><a href="#org1dc67ba">3. Exo n° 3</a>
<ul>
<li><a href="#org173b751">3.1. Question n° 1</a></li>
<li><a href="#orge8c3266">3.2. Question n°2</a></li>
<li><a href="#org36a191e">3.3. Question n°3</a></li>
</ul>
</li>
<li><a href="#org654fa70">4. Exo n°4</a>
<ul>
<li><a href="#org96492aa">4.1. Question n°1</a></li>
<li><a href="#orgcaeaf1c">4.2. Question n°2</a></li>
<li><a href="#orgc86c578">4.3. Question n°3</a></li>
<li><a href="#org102f33e">4.4. Question n°4</a></li>
<li><a href="#orgb70cd77">4.5. Question n°5</a></li>
</ul>
</li>
<li><a href="#org9037221">5. Exo n°5</a>
<ul>
<li><a href="#orga201c17">5.1. Question n°1</a>
<ul>
<li><a href="#orgef57c0a">5.1.1. 12345678 et 53247681 :</a></li>
<li><a href="#org01013a4">5.1.2. 12345678 et 432527861</a></li>
</ul>
</li>
<li><a href="#org2e3d195">5.2. Question n°2</a>
<ul>
<li><a href="#org16a5ce4">5.2.1. Construction Arbre :</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org36480e9" class="outline-2">
<h2 id="org36480e9"><span class="section-number-2">1</span> Exo n°1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org089866b" class="outline-3">
<h3 id="org089866b"><span class="section-number-3">1.1</span> Question n°1</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org5e161d5" class="outline-4">
<h4 id="org5e161d5"><span class="section-number-4">1.1.1</span> Implémentation</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Un arbre sera donc composé : 
</p>
<ul class="org-ul">
<li>un tableau (tab)</li>
<li>La taille du tableau.</li>
<li>L'index/Valeur de la racine (sinon on pourrait le retrouver en parcourant le tableau à la recherche de la case contenant la valeur -1 (Soit une comp. temp. O(n) au pire cas, n étant la taille du tableau)).</li>
<li>Les noeuds seront donc représentés par leur index.</li>
</ul>
</div>
</div>

<div id="outline-container-org8cc43ad" class="outline-4">
<h4 id="org8cc43ad"><span class="section-number-4">1.1.2</span> CreerArbre O(1)</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #93E0E3;">CreerArbre</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">taille</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #DFAF8F;">a</span> = new Arbre<span style="color: #BFEBBF;">()</span>;
  a.tab = <span style="color: #7CB8BB; font-weight: bold;">int</span><span style="color: #BFEBBF;">[</span>taille<span style="color: #BFEBBF;">]</span>;
  a.taille = taille;
  a.racine = -1; <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">On ne sait pas encore l'index de la racine lors de l'initialisation de l'arbre</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> a;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org77a3929" class="outline-4">
<h4 id="org77a3929"><span class="section-number-4">1.1.3</span> Racine O(1) vu qu'on stock son index</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-C">  <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #93E0E3;">Racine</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #DFAF8F;">a</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> a.racine;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d7feb8" class="outline-4">
<h4 id="org3d7feb8"><span class="section-number-4">1.1.4</span> FilsNoeud O(n)</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #93E0E3;">FilsNoeud</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #DFAF8F;">a</span>,<span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">indexNoeud</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Liste</span> <span style="color: #DFAF8F;">l</span> = CreerListe<span style="color: #BFEBBF;">()</span>;
  <span style="color: #F0DFAF; font-weight: bold;">for</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">i</span> = 0; i &lt; a.taille; i ++<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #D0BF8F;">(</span>a.tab<span style="color: #93E0E3;">[</span>i<span style="color: #93E0E3;">]</span> == indexNoeud<span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">{</span>
          l.insererTeteListe<span style="color: #93E0E3;">(</span>i<span style="color: #93E0E3;">)</span>;
        <span style="color: #D0BF8F;">}</span>
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> l;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0090fb2" class="outline-4">
<h4 id="org0090fb2"><span class="section-number-4">1.1.5</span> SontFreres O(1)</h4>
<div class="outline-text-4" id="text-1-1-5">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">bool</span> <span style="color: #93E0E3;">SontFreres</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #DFAF8F;">a</span>, <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">noeud_x</span>, <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">noeud_y</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> a.tab<span style="color: #BFEBBF;">[</span>noued_x<span style="color: #BFEBBF;">]</span> == a.tab<span style="color: #BFEBBF;">[</span>noued_y<span style="color: #BFEBBF;">]</span>; 
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
