TD_arbre.org
*** Hauteur O($n^2$)

#+BEGIN_SRC C 
  int Hauteur(Arbre a)
  {
    int h = 0;
    for (int i = 0; i < a.taille; i++)
      {
        int noeudActuelle = i;
        int pere = a.tab[i];
        int h_actuelle = 0;
        while (noeudActuelle != Racine(a))
          {
            noeudActuelle = pere;
            pere = a.tab[pere];
            h_actuelle++;
          }
        if(h_actuelle > h)
          {
            h = h_actuelle;
          }
      }
    return h;
  }  
#+END_SRC

*** SousArbre $O(n^2)$

#+BEGIN_SRC C
    Arbre SousArbre(Arbre a,int noeud_x)
  {
    Arbre b = CreerArbre(a.taille) // Vu que les valeurs de nos noeuds sont représentées par leur index sur le tableau, on ne peut pas optimiser tant que ça la taille du tableau, de plus si on veut travailler dessus après et qu'on raccourci la taille on pourra être bloqué plus rapidement.

     for (int i = 0; i < a.taille; i++)
      {
        int noeudActuelle = i;
        int pere = a.tab[i];
        int sauv_pere = pere;
        while (noeudActuelle != noeud_x || noeudActuelle != racine(a))
          {
            noeudActuelle = pere;
            pere = a.tab[pere];
          }
      if(i == noeud_x)
        {
          b.tab[i] = -1;
        }
      else if(noeudActuelle == noeud_x)
        {
          b.tab[i] = sauv_pere;
        }
      }
return b
  }
#+END_SRC

** Question n°2

Si on utilise cette nouvelle implémentation, on aura (n est la taille de l'arbre): 
- toujours O(1) pour la création de l'arbre
- O(1) pour savoir si 2 noeuds sont frères (on compare juste les pères)
- O(i) pour la liste des fils : i étant le nbr de fils, pour cela il suffira de stocker dans une liste le premier fils du noeud, puis de récupérer le frère de son premier fils et ceux tant que frères n'est pas null.
- O(1) pour récupérer la racine (notre arbre sera composé que d'un unique noeud représentant la racine, il suffit donc de retourner cette variable) 
- O(n) au pire cas --> O(h) pour la hauteur, h étant justement la hauteur de l'arbre, en effet il suffit d'incrémenter une variable tout en parcourant l'arbre de père en fils à l'aide d'une boucle while (la condition et si fils == null et dans ce cas la variable à comme valeur de base 0).
- O(n) au pire cas --> O(a) : a étant la taille du sous arbre souhaité. (On va devoir recopier dans un nouvelle arbre chaque noeud (qui seront eux aussi des copies pour éviter de modifier l'arbre original) avec une première boucle qui va récupérer chaque premier fils et pour chacun de ces noeuds, on va récupérer tous ses frères sans oublier le noeud x qui aura comme père -1).   

* Exo n°2

** Question n°1

On a : 
-8
-3->8
-3->(8 7)
-3->(8->9 7)
-3->(4->(9 8) 7)

** Question n°2
On pourrait utiliser un tableau si on connait la taille max atteignable de notre tas min, cependant à la différence de la table PERE ou la valeur des noeuds était l'index, ici notre tas min peut avoir plusieurs fois la même valeur et donc nous allons être obligé de stocker à la fois le pere mais aussi la valeur du noeud, mais cela nous permet de mettre n'importe quel noeud dans n'importe quel case (on pourrait aussi stocker filsG et filsD mais dans ce cas on se rapproche plus de la question suivante).

