TD_arbre.html

<div id="outline-container-orgc189219" class="outline-4">
<h4 id="orgc189219"><span class="section-number-4">1.1.6</span> Hauteur O(\(n^2\))</h4>
<div class="outline-text-4" id="text-1-1-6">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #93E0E3;">Hauteur</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #DFAF8F;">a</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">h</span> = 0;
  <span style="color: #F0DFAF; font-weight: bold;">for</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">i</span> = 0; i &lt; a.taille; i++<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">noeudActuelle</span> = i;
      <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">pere</span> = a.tab<span style="color: #D0BF8F;">[</span>i<span style="color: #D0BF8F;">]</span>;
      <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">h_actuelle</span> = 0;
      <span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #D0BF8F;">(</span>noeudActuelle != Racine<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">{</span>
          noeudActuelle = pere;
          pere = a.tab<span style="color: #93E0E3;">[</span>pere<span style="color: #93E0E3;">]</span>;
          h_actuelle++;
        <span style="color: #D0BF8F;">}</span>
      <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #D0BF8F;">(</span>h_actuelle &gt; h<span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">{</span>
          h = h_actuelle;
        <span style="color: #D0BF8F;">}</span>
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> h;
<span style="color: #DCDCCC;">}</span>  
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3f30e0" class="outline-4">
<h4 id="orgd3f30e0"><span class="section-number-4">1.1.7</span> SousArbre \(O(n^2)\)</h4>
<div class="outline-text-4" id="text-1-1-7">
<div class="org-src-container">
<pre class="src src-C">    <span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #93E0E3;">SousArbre</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #DFAF8F;">a</span>,<span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">noeud_x</span><span style="color: #DCDCCC;">)</span>
  <span style="color: #DCDCCC;">{</span>
    <span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #DFAF8F;">b</span> = CreerArbre<span style="color: #BFEBBF;">(</span>a.taille<span style="color: #BFEBBF;">)</span> <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Vu que les valeurs de nos noeuds sont repr&#233;sent&#233;es par leur index sur le tableau, on ne peut pas optimiser tant que &#231;a la taille du tableau, de plus si on veut travailler dessus apr&#232;s et qu'on raccourci la taille on pourra &#234;tre bloqu&#233; plus rapidement.</span>

     <span style="color: #F0DFAF; font-weight: bold;">for</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">i</span> = 0; i &lt; a.taille; i++<span style="color: #BFEBBF;">)</span>
      <span style="color: #BFEBBF;">{</span>
        <span style="color: #7CB8BB; font-weight: bold;">int</span> noeudActuelle = i;
        <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">pere</span> = a.tab<span style="color: #D0BF8F;">[</span>i<span style="color: #D0BF8F;">]</span>;
        <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">sauv_pere</span> = pere;
        <span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #D0BF8F;">(</span>noeudActuelle != noeud_x || noeudActuelle != racine<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
          <span style="color: #D0BF8F;">{</span>
            noeudActuelle = pere;
            pere = a.tab<span style="color: #93E0E3;">[</span>pere<span style="color: #93E0E3;">]</span>;
          <span style="color: #D0BF8F;">}</span>
      <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #D0BF8F;">(</span>i == noeud_x<span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">{</span>
          b.tab<span style="color: #93E0E3;">[</span>i<span style="color: #93E0E3;">]</span> = -1;
        <span style="color: #D0BF8F;">}</span>
      <span style="color: #F0DFAF; font-weight: bold;">else</span> <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #D0BF8F;">(</span>noeudActuelle == noeud_x<span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">{</span>
          b.tab<span style="color: #93E0E3;">[</span>i<span style="color: #93E0E3;">]</span> = sauv_pere;
        <span style="color: #D0BF8F;">}</span>
      <span style="color: #BFEBBF;">}</span>
<span style="color: #F0DFAF; font-weight: bold;">return</span> b
  <span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdb5d605" class="outline-3">
<h3 id="orgdb5d605"><span class="section-number-3">1.2</span> Question n°2</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Si on utilise cette nouvelle implémentation, on aura (n est la taille de l'arbre): 
</p>
<ul class="org-ul">
<li>toujours O(1) pour la création de l'arbre</li>
<li>O(1) pour savoir si 2 noeuds sont frères (on compare juste les pères)</li>
<li>O(i) pour la liste des fils : i étant le nbr de fils, pour cela il suffira de stocker dans une liste le premier fils du noeud, puis de récupérer le frère de son premier fils et ceux tant que frères n'est pas null.</li>
<li>O(1) pour récupérer la racine (notre arbre sera composé que d'un unique noeud représentant la racine, il suffit donc de retourner cette variable)</li>
<li>O(n) au pire cas &#x2013;&gt; O(h) pour la hauteur, h étant justement la hauteur de l'arbre, en effet il suffit d'incrémenter une variable tout en parcourant l'arbre de père en fils à l'aide d'une boucle while (la condition et si fils == null et dans ce cas la variable à comme valeur de base 0).</li>
<li>O(n) au pire cas &#x2013;&gt; O(a) : a étant la taille du sous arbre souhaité. (On va devoir recopier dans un nouvelle arbre chaque noeud (qui seront eux aussi des copies pour éviter de modifier l'arbre original) avec une première boucle qui va récupérer chaque premier fils et pour chacun de ces noeuds, on va récupérer tous ses frères sans oublier le noeud x qui aura comme père -1).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4f428b7" class="outline-2">
<h2 id="org4f428b7"><span class="section-number-2">2</span> Exo n°2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbfbd61a" class="outline-3">
<h3 id="orgbfbd61a"><span class="section-number-3">2.1</span> Question n°1</h3>
<div class="outline-text-3" id="text-2-1">
<p>
On a : 
-8
-3-&gt;8
-3-&gt;(8 7)
-3-&gt;(8-&gt;9 7)
-3-&gt;(4-&gt;(9 8) 7)
</p>
</div>
</div>

<div id="outline-container-org8b883bb" class="outline-3">
<h3 id="org8b883bb"><span class="section-number-3">2.2</span> Question n°2</h3>
<div class="outline-text-3" id="text-2-2">
<p>
On pourrait utiliser un tableau si on connait la taille max atteignable de notre tas min, cependant à la différence de la table PERE ou la valeur des noeuds était l'index, ici notre tas min peut avoir plusieurs fois la même valeur et donc nous allons être obligé de stocker à la fois le pere mais aussi la valeur du noeud, mais cela nous permet de mettre n'importe quel noeud dans n'importe quel case (on pourrait aussi stocker filsG et filsD mais dans ce cas on se rapproche plus de la question suivante).
</p>
</div>
</div>
