TD_arbre.org
** Question n°3

Vu qu'on ne connait pas la place prise par notre tas, utilisait un tableau statique serait une mauvaise idée vu que si notre tableau est trop petit, il faudra tout recopier dans un tableau plus grand (ce qui va prendre beaucoup de temps). Une meilleure solution serait de stocker dans le tas une seule Cellule (la racine), et chaque cellule à accès à son père, son filsG et son filsD (qui sont des cellules) et une valeur .

** Question n°4
   Type du dessus en rajoutant aussi le nombre de noeud (la taille) de la cellule et sa hauteur (pour bien avoir une complexité O(log(n)) pour l'insertion);

** Question n°5 
*** construire-tas O(1)

#+BEGIN_SRC C
    Tas construire-tas()
  {
    Tas t = new Tas();
    t.racine.pere = -1; // pas de père
    return t;
  }
#+END_SRC

*** inserer O(log(n))

#+BEGIN_SRC C
  Tas inserer(Tas t,T val)
  {
    Cellule a = t.racine;
    while (FilsGauche(a) != null || FilsDroit(a) != null)
      {
        Cellule g = FilsGauche(a);
        Cellule d = FilsDroit(a);

        if((d.nbrNoeud == pow(2,d.hauteur+1)-1) && g.hauteur == d.hauteur)
          {
            a.nbrNoeud++;
            a = FilsGauche(a);
          }
        else
          {
            a.nbrNoeud++;
            a = FilsDroit(a);
          }
      }
    a.nbrNoeud++;
    a.hauteur++;
    Cellule h = a;
    while(h.pere != null)
      {
        if (h.pere.hauteur < h.hauteur +1)
          {
            h.pere.hauteur = h.hauteur+1;
          }
        h = h.pere;
      }
    if(FilsGauche(a) == null)
      {

        a.filsGauche = CreerCellule();
        FilsGauche(a).valeur = val+1; 
        FilsGauche(a).pere = a; 
        remplacerCle(FilsGauche(a),val);
      }
    else
      {
        a.filsDroit = CreerCellule();
        FilsDroit(a).valeur = val+1; 
        FilsDroit(a).pere = a; 
        remplacerCle(FilsDroit(a),val);
      }
    return t;
  }  
#+END_SRC

*** entasser-min O(h) = O(log(n))

#+BEGIN_SRC C
  Tas entasserMin (Tas t,cellule r) 
  {
    Cellule min;
    Cellule g = FilsGauche(r);
    Cellule d = FilsDroite(r);
    if (g != NULL && g.valeur <= r.valeur)
      {
        min = g;
      }
    else
      {
        min = r;
      }
    if (d != NULL and d.valeur <= min.valeur)
      {
        min = d;
      }
    if (min != r)
      {
        T tempo = min.valeur;
        min.valeur = r.valeur;
        r.valeur = tempo;
        entasserMin(t,min);
      }
    return t;
  }
#+END_SRC
    
*** minimum O(1)

Juste retourner la valeur de la racine.

