TD_arbre.html

<div id="outline-container-orgc0131cf" class="outline-3">
<h3 id="orgc0131cf"><span class="section-number-3">2.3</span> Question n°3</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Vu qu'on ne connait pas la place prise par notre tas, utilisait un tableau statique serait une mauvaise idée vu que si notre tableau est trop petit, il faudra tout recopier dans un tableau plus grand (ce qui va prendre beaucoup de temps). Une meilleure solution serait de stocker dans le tas une seule Cellule (la racine), et chaque cellule à accès à son père, son filsG et son filsD (qui sont des cellules) et une valeur .
</p>
</div>
</div>

<div id="outline-container-orgf5859dc" class="outline-3">
<h3 id="orgf5859dc"><span class="section-number-3">2.4</span> Question n°4</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Type du dessus en rajoutant aussi le nombre de noeud (la taille) de la cellule et sa hauteur (pour bien avoir une complexité O(log(n)) pour l'insertion);
</p>
</div>
</div>

<div id="outline-container-org8855da8" class="outline-3">
<h3 id="org8855da8"><span class="section-number-3">2.5</span> Question n°5</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org1c8e909" class="outline-4">
<h4 id="org1c8e909"><span class="section-number-4">2.5.1</span> construire-tas O(1)</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-C">  <span style="color: #7CB8BB; font-weight: bold;">Tas</span> <span style="color: #93E0E3;">construire</span>-tas<span style="color: #DCDCCC;">()</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Tas</span> <span style="color: #DFAF8F;">t</span> = new Tas<span style="color: #BFEBBF;">()</span>;
  t.racine.pere = -1; <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">pas de p&#232;re</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> t;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org761759c" class="outline-4">
<h4 id="org761759c"><span class="section-number-4">2.5.2</span> inserer O(log(n))</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">Tas</span> <span style="color: #93E0E3;">inserer</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Tas</span> <span style="color: #DFAF8F;">t</span>,<span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #DFAF8F;">val</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">a</span> = t.racine;
  <span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #BFEBBF;">(</span>FilsGauche<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span> != null || FilsDroit<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span> != null<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">g</span> = FilsGauche<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>;
      <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">d</span> = FilsDroit<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>;

      <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>d.nbrNoeud == pow<span style="color: #9FC59F;">(</span>2,d.hauteur+1<span style="color: #9FC59F;">)</span>-1<span style="color: #93E0E3;">)</span> &amp;&amp; g.hauteur == d.hauteur<span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">{</span>
          a.nbrNoeud++;
          a = FilsGauche<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span>;
        <span style="color: #D0BF8F;">}</span>
      <span style="color: #F0DFAF; font-weight: bold;">else</span>
        <span style="color: #D0BF8F;">{</span>
          a.nbrNoeud++;
          a = FilsDroit<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span>;
        <span style="color: #D0BF8F;">}</span>
    <span style="color: #BFEBBF;">}</span>
  a.nbrNoeud++;
  a.hauteur++;
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">h</span> = a;
  <span style="color: #F0DFAF; font-weight: bold;">while</span><span style="color: #BFEBBF;">(</span>h.pere != null<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #D0BF8F;">(</span>h.pere.hauteur &lt; h.hauteur +1<span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">{</span>
          h.pere.hauteur = h.hauteur+1;
        <span style="color: #D0BF8F;">}</span>
      h = h.pere;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>FilsGauche<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span> == null<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>

      a.filsGauche = CreerCellule<span style="color: #D0BF8F;">()</span>;
      FilsGauche<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>.valeur = val+1; 
      FilsGauche<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>.pere = a; 
      remplacerCle<span style="color: #D0BF8F;">(</span>FilsGauche<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span>,val<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span>
    <span style="color: #BFEBBF;">{</span>
      a.filsDroit = CreerCellule<span style="color: #D0BF8F;">()</span>;
      FilsDroit<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>.valeur = val+1; 
      FilsDroit<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>.pere = a; 
      remplacerCle<span style="color: #D0BF8F;">(</span>FilsDroit<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span>,val<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> t;
<span style="color: #DCDCCC;">}</span>  
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9ef2d3" class="outline-4">
<h4 id="orgb9ef2d3"><span class="section-number-4">2.5.3</span> entasser-min O(h) = O(log(n))</h4>
<div class="outline-text-4" id="text-2-5-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">Tas</span> <span style="color: #93E0E3;">entasserMin</span> <span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Tas</span> <span style="color: #DFAF8F;">t</span>,<span style="color: #7CB8BB; font-weight: bold;">cellule</span> <span style="color: #DFAF8F;">r</span><span style="color: #DCDCCC;">)</span> 
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">min</span>;
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">g</span> = FilsGauche<span style="color: #BFEBBF;">(</span>r<span style="color: #BFEBBF;">)</span>;
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">d</span> = FilsDroite<span style="color: #BFEBBF;">(</span>r<span style="color: #BFEBBF;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #BFEBBF;">(</span>g != <span style="color: #BFEBBF;">NULL</span> &amp;&amp; g.valeur &lt;= r.valeur<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      min = g;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span>
    <span style="color: #BFEBBF;">{</span>
      min = r;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #BFEBBF;">(</span>d != <span style="color: #BFEBBF;">NULL</span> and d.valeur &lt;= min.valeur<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      min = d;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #BFEBBF;">(</span>min != r<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      <span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #DFAF8F;">tempo</span> = min.valeur;
      min.valeur = r.valeur;
      r.valeur = tempo;
      entasserMin<span style="color: #D0BF8F;">(</span>t,min<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> t;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga3768a2" class="outline-4">
<h4 id="orga3768a2"><span class="section-number-4">2.5.4</span> minimum O(1)</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
Juste retourner la valeur de la racine.
</p>
</div>
</div>
