TD_arbre.org
*** remplacerCle O(h(x)) ou O(h-h(x))

#+BEGIN_SRC C
  Tas remplacerCle(Tas t,Cellule r,T val)
  {
    if(r.valeur < val)
      {
        r.valeur = val;
        entasserMin(t,r);
      }

    else
      {
        if (r.valeur > val)
          {
            r.valeur = r.pere.valeur;
            r.pere.valeur = val + 1;
            remplacerCle(r.pere,val);
          }
      }
  return t;
  }
#+END_SRC

*** retirerElement O(h)
 
#+BEGIN_SRC C

  retirerElement(Tas t,cellule r)
  {
    Cellule c = t.racine;
    while (filsGauche(c) != null && filsDroite(c) != null) {

      if(FilsGauche(c).nbrNoeud == pow(2,FilsGauche(c).hauteur+1)-1)
        {
          c.nbrNoeud--;
          c = FilsDroite(c);
        }
      else 
        {
          c.nbrNoeud--;
          c = FilsGauche(c);
        }
    }

    if(c == FilsGauche(Pere(c)))
      {
        Pere(c).hauteur--;
      }
    r.valeur = c.valeur;
    free(c);
    entasserMin(t,r);
  }
    #+END_SRC

    

    

** Question n°6 

Pour récupérer la maximum dans un tas min, il va falloir prendre le maximum entre toutes les feuilles, c'est à dire une complexité O(n).

** Question n°7 O(n*log(n))

#+BEGIN_SRC  C
  T[] tri(Tas t)
  {
    n = t.racine.nbrNoeud;
    T[] = new T[n];
    for (int i = 0; i < n; i++)
      {
        t[i] = minimum(t);
        retirerElement(t,t.racine);
      }
    return t;
  }
#+END_SRC


** Question n°8 

Les opérations de la file de priorité sont : insérer,maximum,extraire-max et remplacer, ce qui correspond respectivement avec un tas-max à insérer, maximum, retirerElement(t,t.racine), remplacerCle. 

* Exo n° 3 

** Question n° 1 

Il est assez simple de représenter une expression arithmétique avec un arbre binaire, (surtout avec la notation polonaise --> (2*3) devient (* 2 3)) On va stocker dans la racine la dernière opérations à effectuer, dans son sous arbre gauche l'opération à effectuer avant celle ci et qui va donner l'opérante gauche, de même avec avec la partie droite pour l'opérante droite. Et ceux juqu'au feuilles ou on aura les constantes. Il nous suffira donc d'appeler récursivement depuis la racine et ceux jusqu'au opérations avant les feuilles une méthode *résolution*,puis remonter petit à petit, si on suit cette méthode il n'y a même pas besoin de spécifier les priorités.

