TD_arbre.html

<div id="outline-container-org1c71a71" class="outline-4">
<h4 id="org1c71a71"><span class="section-number-4">2.5.5</span> remplacerCle O(h(x)) ou O(h-h(x))</h4>
<div class="outline-text-4" id="text-2-5-5">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">Tas</span> <span style="color: #93E0E3;">remplacerCle</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Tas</span> <span style="color: #DFAF8F;">t</span>,<span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">r</span>,<span style="color: #7CB8BB; font-weight: bold;">T</span> <span style="color: #DFAF8F;">val</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>r.valeur &lt; val<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      r.valeur = val;
      entasserMin<span style="color: #D0BF8F;">(</span>t,r<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>

  <span style="color: #F0DFAF; font-weight: bold;">else</span>
    <span style="color: #BFEBBF;">{</span>
      <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #D0BF8F;">(</span>r.valeur &gt; val<span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">{</span>
          r.valeur = r.pere.valeur;
          r.pere.valeur = val + 1;
          remplacerCle<span style="color: #93E0E3;">(</span>r.pere,val<span style="color: #93E0E3;">)</span>;
        <span style="color: #D0BF8F;">}</span>
    <span style="color: #BFEBBF;">}</span>
<span style="color: #F0DFAF; font-weight: bold;">return</span> t;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org547da7c" class="outline-4">
<h4 id="org547da7c"><span class="section-number-4">2.5.6</span> retirerElement O(h)</h4>
<div class="outline-text-4" id="text-2-5-6">
<div class="org-src-container">
<pre class="src src-C">
<span style="color: #93E0E3;">retirerElement</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Tas</span> <span style="color: #DFAF8F;">t</span>,<span style="color: #7CB8BB; font-weight: bold;">cellule</span> <span style="color: #DFAF8F;">r</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">Cellule</span> <span style="color: #DFAF8F;">c</span> = t.racine;
  <span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #BFEBBF;">(</span>filsGauche<span style="color: #D0BF8F;">(</span>c<span style="color: #D0BF8F;">)</span> != null &amp;&amp; filsDroite<span style="color: #D0BF8F;">(</span>c<span style="color: #D0BF8F;">)</span> != null<span style="color: #BFEBBF;">)</span> <span style="color: #BFEBBF;">{</span>

    <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #D0BF8F;">(</span>FilsGauche<span style="color: #93E0E3;">(</span>c<span style="color: #93E0E3;">)</span>.nbrNoeud == pow<span style="color: #93E0E3;">(</span>2,FilsGauche<span style="color: #9FC59F;">(</span>c<span style="color: #9FC59F;">)</span>.hauteur+1<span style="color: #93E0E3;">)</span>-1<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">{</span>
        c.nbrNoeud--;
        c = FilsDroite<span style="color: #93E0E3;">(</span>c<span style="color: #93E0E3;">)</span>;
      <span style="color: #D0BF8F;">}</span>
    <span style="color: #F0DFAF; font-weight: bold;">else</span> 
      <span style="color: #D0BF8F;">{</span>
        c.nbrNoeud--;
        c = FilsGauche<span style="color: #93E0E3;">(</span>c<span style="color: #93E0E3;">)</span>;
      <span style="color: #D0BF8F;">}</span>
  <span style="color: #BFEBBF;">}</span>

  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>c == FilsGauche<span style="color: #D0BF8F;">(</span>Pere<span style="color: #93E0E3;">(</span>c<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      Pere<span style="color: #D0BF8F;">(</span>c<span style="color: #D0BF8F;">)</span>.hauteur--;
    <span style="color: #BFEBBF;">}</span>
  r.valeur = c.valeur;
  free<span style="color: #BFEBBF;">(</span>c<span style="color: #BFEBBF;">)</span>;
  entasserMin<span style="color: #BFEBBF;">(</span>t,r<span style="color: #BFEBBF;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>





<div id="outline-container-org2f822b1" class="outline-3">
<h3 id="org2f822b1"><span class="section-number-3">2.6</span> Question n°6</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Pour récupérer la maximum dans un tas min, il va falloir prendre le maximum entre toutes les feuilles, c'est à dire une complexité O(n).
</p>
</div>
</div>

<div id="outline-container-orgd3bd641" class="outline-3">
<h3 id="orgd3bd641"><span class="section-number-3">2.7</span> Question n°7 O(n*log(n))</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">T</span><span style="color: #DCDCCC;">[]</span> tri<span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Tas</span> <span style="color: #DFAF8F;">t</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  n = t.racine.nbrNoeud;
  T<span style="color: #BFEBBF;">[]</span> = new T<span style="color: #BFEBBF;">[</span>n<span style="color: #BFEBBF;">]</span>;
  <span style="color: #F0DFAF; font-weight: bold;">for</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">i</span> = 0; i &lt; n; i++<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      t<span style="color: #D0BF8F;">[</span>i<span style="color: #D0BF8F;">]</span> = minimum<span style="color: #D0BF8F;">(</span>t<span style="color: #D0BF8F;">)</span>;
      retirerElement<span style="color: #D0BF8F;">(</span>t,t.racine<span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> t;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org860d81d" class="outline-3">
<h3 id="org860d81d"><span class="section-number-3">2.8</span> Question n°8</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Les opérations de la file de priorité sont : insérer,maximum,extraire-max et remplacer, ce qui correspond respectivement avec un tas-max à insérer, maximum, retirerElement(t,t.racine), remplacerCle. 
</p>
</div>
</div>
</div>

<div id="outline-container-org1dc67ba" class="outline-2">
<h2 id="org1dc67ba"><span class="section-number-2">3</span> Exo n° 3</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org173b751" class="outline-3">
<h3 id="org173b751"><span class="section-number-3">3.1</span> Question n° 1</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Il est assez simple de représenter une expression arithmétique avec un arbre binaire, (surtout avec la notation polonaise &#x2013;&gt; (2*3) devient (* 2 3)) On va stocker dans la racine la dernière opérations à effectuer, dans son sous arbre gauche l'opération à effectuer avant celle ci et qui va donner l'opérante gauche, de même avec avec la partie droite pour l'opérante droite. Et ceux juqu'au feuilles ou on aura les constantes. Il nous suffira donc d'appeler récursivement depuis la racine et ceux jusqu'au opérations avant les feuilles une méthode <b>résolution</b>,puis remonter petit à petit, si on suit cette méthode il n'y a même pas besoin de spécifier les priorités.
</p>
</div>
</div>
