TD_arbre.org
** Question n°2 

On va utiliser un parcours en profondeur(suffixe). Si on utilise un parcours préfixe, ou infixe on ne va pas connaître l' opérantes de droite (infixe) voir les deux (préfixe). De même pour le parcours en longueur.

#+BEGIN_SRC C  
  float eval(Arbre a)
  {
    float g,d,retour;
    if(FilsGauche(a).valeur == *opérations*)
      {
        g = eval(ArbreGauche(a));
      }
    else
      {
        g = FilsGauche(a).valeur;
      }
    if(FilsDroit(a).valeur == *opérations*)
      {
        d = eval(ArbreDroit(a));
      }
    else
      {
        d = FilsGauche(a).valeur;
      }
    if(a.racine.valeur == '+')
      {
        retour = g+d;
      }
    // et de même pour toutes les opérations;
    return retour;
  } 

#+END_SRC

** Question n°3 

   Ce sera le même principes avec au noeud soit True Ou false et comme noeud interne Soit OR, AND (2 fils) soit NOT (1 fils), la seule différence est que notre arbre binaire n'est pas forcément parfait ni presque parfait.

#+BEGIN_SRC C
  bool eval(Arbre a)
  {
    bool g,d,retour;
    if(FilsGauche(a).valeur == *opérations*)
      {
        g = eval(ArbreGauche(a));
      }
    else
      {
        g = FilsGauche(a).valeur;
      }
    if(FilsDroit(a) != null)
      {
        if( FilsDroit(a).valeur == *opérations*)
          {
            d = eval(ArbreDroit(a));
          }
        else
          {
            d = FilsGauche(a).valeur;
          }
      }
    if(a.racine.valeur == "AND")
      {
        retour = g && d;
      }
    if(a.racine.valeur == "NOT")
      {
        retour = not g;
      }
    // et de même pour toutes les opérations;
    return retour;
  } 
#+END_SRC

* Exo n°4

** Question n°1

   Récurrence ::: 

   Initialisation :::
   hauteur 0, c'est à dire que x = racine donc il ne peut y avoir qu'un chemin (x -> x)

   Hérédité :::
   Supposons que la propriété est vrai pour tout x de hauteur <= n, c'est à dire qu'il n'existe qu'un seul chemin entre x et la racine r que l'on appellera chm.
   Prenons $x_1$ fils de x, $x_1$ a donc de hauteur n+1, Prouvons qu'il n'existe qu'un seul chemin entre $x_1$ et r.
   La seule direction possible pour $x_1$ allant vers la racine est de passer par son père x, ensuite il ne pourra prendre que le chemin uniqur chm, donc proposition vérifié pour $x_1$.

** Question n°2

      Récurrence ::: 

   Initialisation :::
   noeud 1, c'est à dire qu'il n'y a que la racine, qui est une feuille.

   Hérédité :::
   Supposons que la propriété est vrai pour tout arbre ayant <= n noeud, c'est à dire qu'il y a au moins une feuille dans l'arbre T que l'on va notée f.
   Ajoutons lui un nouveau noeud x, Prouvons qu'il la propriété est toujours vérifier.
   Si x est fils de d, alors f ne sera plus feuille mais x deviendra feuille puisque qu'il n'a pas d'enfants. Sinon f restera feuille. 

