TD_arbre.html

<div id="outline-container-orge8c3266" class="outline-3">
<h3 id="orge8c3266"><span class="section-number-3">3.2</span> Question n°2</h3>
<div class="outline-text-3" id="text-3-2">
<p>
On va utiliser un parcours en profondeur(suffixe). Si on utilise un parcours préfixe, ou infixe on ne va pas connaître l' opérantes de droite (infixe) voir les deux (préfixe). De même pour le parcours en longueur.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">float</span> <span style="color: #93E0E3;">eval</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #DFAF8F;">a</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">float</span> <span style="color: #DFAF8F;">g</span>,<span style="color: #DFAF8F;">d</span>,<span style="color: #DFAF8F;">retour</span>;
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>FilsGauche<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>.valeur == *op&#233;rations*<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      g = eval<span style="color: #D0BF8F;">(</span>ArbreGauche<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span>
    <span style="color: #BFEBBF;">{</span>
      g = FilsGauche<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>.valeur;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>FilsDroit<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>.valeur == *op&#233;rations*<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      d = eval<span style="color: #D0BF8F;">(</span>ArbreDroit<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span>
    <span style="color: #BFEBBF;">{</span>
      d = FilsGauche<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>.valeur;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>a.racine.valeur == <span style="color: #CC9393;">'+'</span><span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      retour = g+d;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">et de m&#234;me pour toutes les op&#233;rations;</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> retour;
<span style="color: #DCDCCC;">}</span> 

</pre>
</div>
</div>
</div>

<div id="outline-container-org36a191e" class="outline-3">
<h3 id="org36a191e"><span class="section-number-3">3.3</span> Question n°3</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Ce sera le même principes avec au noeud soit True Ou false et comme noeud interne Soit OR, AND (2 fils) soit NOT (1 fils), la seule différence est que notre arbre binaire n'est pas forcément parfait ni presque parfait.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">bool</span> <span style="color: #93E0E3;">eval</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #DFAF8F;">a</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
  <span style="color: #7CB8BB; font-weight: bold;">bool</span> <span style="color: #DFAF8F;">g</span>,<span style="color: #DFAF8F;">d</span>,<span style="color: #DFAF8F;">retour</span>;
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>FilsGauche<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>.valeur == *op&#233;rations*<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      g = eval<span style="color: #D0BF8F;">(</span>ArbreGauche<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span>
    <span style="color: #BFEBBF;">{</span>
      g = FilsGauche<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span>.valeur;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>FilsDroit<span style="color: #D0BF8F;">(</span>a<span style="color: #D0BF8F;">)</span> != null<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #D0BF8F;">(</span> FilsDroit<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span>.valeur == *op&#233;rations*<span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">{</span>
          d = eval<span style="color: #93E0E3;">(</span>ArbreDroit<span style="color: #9FC59F;">(</span>a<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>;
        <span style="color: #D0BF8F;">}</span>
      <span style="color: #F0DFAF; font-weight: bold;">else</span>
        <span style="color: #D0BF8F;">{</span>
          d = FilsGauche<span style="color: #93E0E3;">(</span>a<span style="color: #93E0E3;">)</span>.valeur;
        <span style="color: #D0BF8F;">}</span>
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>a.racine.valeur == <span style="color: #CC9393;">"AND"</span><span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      retour = g &amp;&amp; d;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>a.racine.valeur == <span style="color: #CC9393;">"NOT"</span><span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">{</span>
      retour = not g;
    <span style="color: #BFEBBF;">}</span>
  <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">et de m&#234;me pour toutes les op&#233;rations;</span>
  <span style="color: #F0DFAF; font-weight: bold;">return</span> retour;
<span style="color: #DCDCCC;">}</span> 
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org654fa70" class="outline-2">
<h2 id="org654fa70"><span class="section-number-2">4</span> Exo n°4</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org96492aa" class="outline-3">
<h3 id="org96492aa"><span class="section-number-3">4.1</span> Question n°1</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Récurrence ::: 
</p>

<p>
Initialisation :::
hauteur 0, c'est à dire que x = racine donc il ne peut y avoir qu'un chemin (x -&gt; x)
</p>

<p>
Hérédité :::
Supposons que la propriété est vrai pour tout x de hauteur &lt;= n, c'est à dire qu'il n'existe qu'un seul chemin entre x et la racine r que l'on appellera chm.
Prenons \(x_1\) fils de x, \(x_1\) a donc de hauteur n+1, Prouvons qu'il n'existe qu'un seul chemin entre \(x_1\) et r.
La seule direction possible pour \(x_1\) allant vers la racine est de passer par son père x, ensuite il ne pourra prendre que le chemin uniqur chm, donc proposition vérifié pour \(x_1\).
</p>
</div>
</div>

<div id="outline-container-orgcaeaf1c" class="outline-3">
<h3 id="orgcaeaf1c"><span class="section-number-3">4.2</span> Question n°2</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Récurrence ::: 
</p>

<p>
Initialisation :::
noeud 1, c'est à dire qu'il n'y a que la racine, qui est une feuille.
</p>

<p>
Hérédité :::
Supposons que la propriété est vrai pour tout arbre ayant &lt;= n noeud, c'est à dire qu'il y a au moins une feuille dans l'arbre T que l'on va notée f.
Ajoutons lui un nouveau noeud x, Prouvons qu'il la propriété est toujours vérifier.
Si x est fils de d, alors f ne sera plus feuille mais x deviendra feuille puisque qu'il n'a pas d'enfants. Sinon f restera feuille. 
</p>
</div>
</div>
