TD_arbre.org
** Question n°3

      Récurrence ::: 

   Initialisation :::
   noeud 1, c'est à dire qu'il n'y a que la racine r
   On a donc V = {r} et E = $\emptyset$ => |V| -1 = |E|

   Hérédité :::
   Supposons que la propriété est vrai pour tout arbre ayant <= n noeud.
   Ajoutons lui un nouveau noeud x, Prouvons que la propriété est toujours vérifier.
   Notons p le père de x, V' et E' l'ensemble et relations binaires avant l'ajout de x
   On à donc maintenant $V = V' \bigcup {x}$ et $E = E' \bigcup (p,x)$.
   Donc |V| = |V'| +1 et |E| = |E'| +1 (|V| = |E|).    

** Question n°4

      Récurrence ::: 

   Initialisation :::
   hauteur = 0, c'est à dire qu'il y a 1 feuille pour 1 noeud (1 = 2*1-1)

   Hérédité :::
   Supposons que la propriété est vrai pour tout arbre ayant une hauteur <=  h.
   Prouvons que la propriété est toujours vérifier pour tout arbre binaire de hauteur > h.
   Soit T l'arbre de hauteur h+1 et soit f le nbr de feuilles de l'arbre de hauteur h.
   On à donc maintenant 2*f nbr de feuilles (noté $f_1$) (vu que chaque noeud précédent à maintenant 2 fils) et comme noeuds totale 2*f-1 + $f_1$.
   Soit nbr de noeuds = $f_1$ -1 +$f_1$ => 2*$f_1$-1

** Question n°5

      Récurrence ::: 

   Initialisation :::
   hauteur = 0, c'est à dire qu'il y a qu'une feuille (la racine) (1 <= $2^0$ = 1)

   Hérédité :::
   Supposons que la propriété est vrai pour tout arbre ayant une hauteur <=  h.
   Prouvons que la propriété est toujours vérifier pour tout arbre binaire de hauteur > h.
   Soit T l'arbre de hauteur h+1 et soit f le nbr de feuilles de l'arbre de hauteur h.
   Le nbr de feuilles $f_1$ de l'arbre T sera au maximum f*2 (puisque l'arbre est binaires)
   Donc f \leq $2^h$ ==> 2*f \leq $2^{h+1}$ ==> $f_1 \leq 2^{hauteur(T)}$ 
   
* Exo n°5

** Question n°1

*** 12345678 et 53247681 :

- L'arbre binaire n'existe pas 

*** 12345678 et 432527861

- L'arbre binaire existe (le parcours en longueur donne : 1/ 2 6/ 3 5 7 8/4)



** Question n°2

