TD_arbre.html

<div id="outline-container-orgc86c578" class="outline-3">
<h3 id="orgc86c578"><span class="section-number-3">4.3</span> Question n°3</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Récurrence ::: 
</p>

<p>
Initialisation :::
noeud 1, c'est à dire qu'il n'y a que la racine r
On a donc V = {r} et E = \(\emptyset\) =&gt; |V| -1 = |E|
</p>

<p>
Hérédité :::
Supposons que la propriété est vrai pour tout arbre ayant &lt;= n noeud.
Ajoutons lui un nouveau noeud x, Prouvons que la propriété est toujours vérifier.
Notons p le père de x, V' et E' l'ensemble et relations binaires avant l'ajout de x
On à donc maintenant \(V = V' \bigcup {x}\) et \(E = E' \bigcup (p,x)\).
Donc |V| = |V'| +1 et |E| = |E'| +1 (|V| = |E|).    
</p>
</div>
</div>

<div id="outline-container-org102f33e" class="outline-3">
<h3 id="org102f33e"><span class="section-number-3">4.4</span> Question n°4</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Récurrence ::: 
</p>

<p>
Initialisation :::
hauteur = 0, c'est à dire qu'il y a 1 feuille pour 1 noeud (1 = 2*1-1)
</p>

<p>
Hérédité :::
Supposons que la propriété est vrai pour tout arbre ayant une hauteur &lt;=  h.
Prouvons que la propriété est toujours vérifier pour tout arbre binaire de hauteur &gt; h.
Soit T l'arbre de hauteur h+1 et soit f le nbr de feuilles de l'arbre de hauteur h.
On à donc maintenant 2*f nbr de feuilles (noté \(f_1\)) (vu que chaque noeud précédent à maintenant 2 fils) et comme noeuds totale 2*f-1 + \(f_1\).
Soit nbr de noeuds = \(f_1\) -1 +\(f_1\) =&gt; 2*$f<sub>1</sub>$-1
</p>
</div>
</div>

<div id="outline-container-orgb70cd77" class="outline-3">
<h3 id="orgb70cd77"><span class="section-number-3">4.5</span> Question n°5</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Récurrence ::: 
</p>

<p>
Initialisation :::
hauteur = 0, c'est à dire qu'il y a qu'une feuille (la racine) (1 &lt;= \(2^0\) = 1)
</p>

<p>
Hérédité :::
Supposons que la propriété est vrai pour tout arbre ayant une hauteur &lt;=  h.
Prouvons que la propriété est toujours vérifier pour tout arbre binaire de hauteur &gt; h.
Soit T l'arbre de hauteur h+1 et soit f le nbr de feuilles de l'arbre de hauteur h.
Le nbr de feuilles \(f_1\) de l'arbre T sera au maximum f*2 (puisque l'arbre est binaires)
Donc f &le; \(2^h\) ==&gt; 2*f &le; \(2^{h+1}\) ==&gt; \(f_1 \leq 2^{hauteur(T)}\) 
</p>
</div>
</div>
</div>

<div id="outline-container-org9037221" class="outline-2">
<h2 id="org9037221"><span class="section-number-2">5</span> Exo n°5</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orga201c17" class="outline-3">
<h3 id="orga201c17"><span class="section-number-3">5.1</span> Question n°1</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgef57c0a" class="outline-4">
<h4 id="orgef57c0a"><span class="section-number-4">5.1.1</span> 12345678 et 53247681 :</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>L'arbre binaire n'existe pas</li>
</ul>
</div>
</div>

<div id="outline-container-org01013a4" class="outline-4">
<h4 id="org01013a4"><span class="section-number-4">5.1.2</span> 12345678 et 432527861</h4>
<div class="outline-text-4" id="text-5-1-2">
<ul class="org-ul">
<li>L'arbre binaire existe (le parcours en longueur donne : 1/ 2 6/ 3 5 7 8/4)</li>
</ul>
</div>
</div>
</div>
