TD_arbre.tex

\subsection{Question n°3}
\label{sec:org91be3b2}

Récurrence ::: 

Initialisation :::
noeud 1, c'est à dire qu'il n'y a que la racine r
On a donc V = \{r\} et E = \(\emptyset\) => |V| -1 = |E|

Hérédité :::
Supposons que la propriété est vrai pour tout arbre ayant <= n noeud.
Ajoutons lui un nouveau noeud x, Prouvons que la propriété est toujours vérifier.
Notons p le père de x, V' et E' l'ensemble et relations binaires avant l'ajout de x
On à donc maintenant \(V = V' \bigcup {x}\) et \(E = E' \bigcup (p,x)\).
Donc |V| = |V'| +1 et |E| = |E'| +1 (|V| = |E|).    

\subsection{Question n°4}
\label{sec:org99170df}

Récurrence ::: 

Initialisation :::
hauteur = 0, c'est à dire qu'il y a 1 feuille pour 1 noeud (1 = 2*1-1)

Hérédité :::
Supposons que la propriété est vrai pour tout arbre ayant une hauteur <=  h.
Prouvons que la propriété est toujours vérifier pour tout arbre binaire de hauteur > h.
Soit T l'arbre de hauteur h+1 et soit f le nbr de feuilles de l'arbre de hauteur h.
On à donc maintenant 2*f nbr de feuilles (noté \(f_1\)) (vu que chaque noeud précédent à maintenant 2 fils) et comme noeuds totale 2*f-1 + \(f_1\).
Soit nbr de noeuds = \(f_1\) -1 +\(f_1\) => 2*\$f\(_{\text{1}}\)\$-1

\subsection{Question n°5}
\label{sec:org01447ba}

Récurrence ::: 

Initialisation :::
hauteur = 0, c'est à dire qu'il y a qu'une feuille (la racine) (1 <= \(2^0\) = 1)

Hérédité :::
Supposons que la propriété est vrai pour tout arbre ayant une hauteur <=  h.
Prouvons que la propriété est toujours vérifier pour tout arbre binaire de hauteur > h.
Soit T l'arbre de hauteur h+1 et soit f le nbr de feuilles de l'arbre de hauteur h.
Le nbr de feuilles \(f_1\) de l'arbre T sera au maximum f*2 (puisque l'arbre est binaires)
Donc f \(\le\) \(2^h\) ==> 2*f \(\le\) \(2^{h+1}\) ==> \(f_1 \leq 2^{hauteur(T)}\) 

\section{Exo n°5}
\label{sec:org78686f8}

\subsection{Question n°1}
\label{sec:org17ccf0d}

\subsubsection{12345678 et 53247681 :}
\label{sec:org44f32b6}

\begin{itemize}
\item L'arbre binaire n'existe pas
\end{itemize}

\subsubsection{12345678 et 432527861}
\label{sec:orgca3620a}

\begin{itemize}
\item L'arbre binaire existe (le parcours en longueur donne : 1/ 2 6/ 3 5 7 8/4)
\end{itemize}
