TD_arbre.org
*** Construction Arbre : 
 - J'ai pris la notation de python pour obtenir des sous-String, sinon il faudrait créer une fonction qui renvoie une sous string en fonction de l'index de départ et d'arrivé et sauvegarder la taille à chaque fois.
 - FindIndexDans(String,char) va renvoyer la position du char dans le String en parcourant le string 
 - Dans cette exo un noeud est représenté par un entier valeur et par 2 noeuds (filsG et filsD), pas besoin du père ici. 
 - Un arbre est donc seulement un noeud que l'on appelle racine.
#+BEGIN_SRC C
      Arbre CreationRacine(String pre,String post)
      {
      Arbre a = CreerArbre();
      a.racine.val = pre[0];
      CreationArbreInterne(a.racine,pre[1:],post[:-1])
      return a;
      }

      void  CreationArbeInterne(Noeud n,String pre,String post)
      {
       if(taille(pre) > 1)
         {
           g = CreerNoeud();
           g.val = pre[0];
           n.filsG = g;
           d = CreerNoeud();
           d.val = post[-1];
           n.filsD = d;

           int posInterPost = FindIndexDans(post,pre[0]);
           int posInterPre = FindIndexDans(pre,post[-1]);

           CreationArbreInterne(g,pre[1:postInterPre],post[0:posInterPost]);
           CreationArbreInterne(d,pre[postInterPre+1:],post[postInerPost+1:-1]);
         }
       else if (taille(pre)> 0)
         {
           g = CreerNoeud();
           g.val = pre[0];
           n.filsG = g;
         }
      }
#+END_SRC

on aurait pu avoir un probleme si notre arbre n'est pas binaire, en effet si on avait eu 12345678 et 432528761, on aurait du avoir 6 -->7 --> 8 et non pas. Il faudrait donc un peu modifier l'algo
+-----+
|  6  |
| / \ |
|7   8|
+-----+
