TD_arbre.html



<div id="outline-container-org2e3d195" class="outline-3">
<h3 id="org2e3d195"><span class="section-number-3">5.2</span> Question n°2</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org16a5ce4" class="outline-4">
<h4 id="org16a5ce4"><span class="section-number-4">5.2.1</span> Construction Arbre :</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>J'ai pris la notation de python pour obtenir des sous-String, sinon il faudrait créer une fonction qui renvoie une sous string en fonction de l'index de départ et d'arrivé et sauvegarder la taille à chaque fois.</li>
<li>FindIndexDans(String,char) va renvoyer la position du char dans le String en parcourant le string</li>
<li>Dans cette exo un noeud est représenté par un entier valeur et par 2 noeuds (filsG et filsD), pas besoin du père ici.</li>
<li>Un arbre est donc seulement un noeud que l'on appelle racine.</li>
</ul>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #93E0E3;">CreationRacine</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">String</span> <span style="color: #DFAF8F;">pre</span>,<span style="color: #7CB8BB; font-weight: bold;">String</span> <span style="color: #DFAF8F;">post</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
<span style="color: #7CB8BB; font-weight: bold;">Arbre</span> <span style="color: #DFAF8F;">a</span> = CreerArbre<span style="color: #BFEBBF;">()</span>;
a.racine.val = pre<span style="color: #BFEBBF;">[</span>0<span style="color: #BFEBBF;">]</span>;
CreationArbreInterne<span style="color: #BFEBBF;">(</span>a.racine,pre<span style="color: #D0BF8F;">[</span>1:<span style="color: #D0BF8F;">]</span>,post<span style="color: #D0BF8F;">[</span>:-1<span style="color: #D0BF8F;">]</span><span style="color: #BFEBBF;">)</span>
<span style="color: #F0DFAF; font-weight: bold;">return</span> a;
<span style="color: #DCDCCC;">}</span>

<span style="color: #7CB8BB; font-weight: bold;">void</span>  <span style="color: #93E0E3;">CreationArbeInterne</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB; font-weight: bold;">Noeud</span> <span style="color: #DFAF8F;">n</span>,<span style="color: #7CB8BB; font-weight: bold;">String</span> <span style="color: #DFAF8F;">pre</span>,<span style="color: #7CB8BB; font-weight: bold;">String</span> <span style="color: #DFAF8F;">post</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">{</span>
 <span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #BFEBBF;">(</span>taille<span style="color: #D0BF8F;">(</span>pre<span style="color: #D0BF8F;">)</span> &gt; 1<span style="color: #BFEBBF;">)</span>
   <span style="color: #BFEBBF;">{</span>
     g = CreerNoeud<span style="color: #D0BF8F;">()</span>;
     g.val = pre<span style="color: #D0BF8F;">[</span>0<span style="color: #D0BF8F;">]</span>;
     n.filsG = g;
     d = CreerNoeud<span style="color: #D0BF8F;">()</span>;
     d.val = post<span style="color: #D0BF8F;">[</span>-1<span style="color: #D0BF8F;">]</span>;
     n.filsD = d;

     <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">posInterPost</span> = FindIndexDans<span style="color: #D0BF8F;">(</span>post,pre<span style="color: #93E0E3;">[</span>0<span style="color: #93E0E3;">]</span><span style="color: #D0BF8F;">)</span>;
     <span style="color: #7CB8BB; font-weight: bold;">int</span> <span style="color: #DFAF8F;">posInterPre</span> = FindIndexDans<span style="color: #D0BF8F;">(</span>pre,post<span style="color: #93E0E3;">[</span>-1<span style="color: #93E0E3;">]</span><span style="color: #D0BF8F;">)</span>;

     CreationArbreInterne<span style="color: #D0BF8F;">(</span>g,pre<span style="color: #93E0E3;">[</span>1:postInterPre<span style="color: #93E0E3;">]</span>,post<span style="color: #93E0E3;">[</span>0:posInterPost<span style="color: #93E0E3;">]</span><span style="color: #D0BF8F;">)</span>;
     CreationArbreInterne<span style="color: #D0BF8F;">(</span>d,pre<span style="color: #93E0E3;">[</span>postInterPre+1:<span style="color: #93E0E3;">]</span>,post<span style="color: #93E0E3;">[</span>postInerPost+1:-1<span style="color: #93E0E3;">]</span><span style="color: #D0BF8F;">)</span>;
   <span style="color: #BFEBBF;">}</span>
 <span style="color: #F0DFAF; font-weight: bold;">else</span> <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #BFEBBF;">(</span>taille<span style="color: #D0BF8F;">(</span>pre<span style="color: #D0BF8F;">)</span>&gt; 0<span style="color: #BFEBBF;">)</span>
   <span style="color: #BFEBBF;">{</span>
     g = CreerNoeud<span style="color: #D0BF8F;">()</span>;
     g.val = pre<span style="color: #D0BF8F;">[</span>0<span style="color: #D0BF8F;">]</span>;
     n.filsG = g;
   <span style="color: #BFEBBF;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
on aurait pu avoir un probleme si notre arbre n'est pas binaire, en effet si on avait eu 12345678 et 432528761, on aurait du avoir 6 &#x2013;&gt;7 &#x2013;&gt; 8 et non pas. Il faudrait donc un peu modifier l'algo
</p>
<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;6&nbsp;&nbsp;<br />
      &nbsp;/&nbsp;\&nbsp;<br />
      7&nbsp;&nbsp;&nbsp;8
    </td>
  </tr>
</table>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: cliquot</p>
<p class="date">Created: 2021-03-28 dim. 16:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
